<a href="https://colab.research.google.com/github/Won9999/test_machinelearning/blob/main/titanic_withoutonehot_logisticregression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
import seaborn as sns

In [4]:
df = sns.load_dataset('titanic')
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [5]:
df

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [7]:
X = df[['pclass','sibsp', 'parch', 'fare']]
Y = df[['survived']]
X.shape, Y.shape

((891, 4), (891, 1))

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
x_train,x_test,y_train,y_test = train_test_split(X,Y)
x_train.shape, x_test.shape, y_train.shape, y_test.shape

((668, 4), (223, 4), (668, 1), (223, 1))

In [10]:
from sklearn.linear_model import LogisticRegression

In [11]:
logR = LogisticRegression()
type(logR)

sklearn.linear_model._logistic.LogisticRegression

In [12]:
logR.fit(x_train,y_train)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [13]:
logR.classes_

array([0, 1])

In [14]:
logR.coef_

array([[-0.52611242, -0.14173898,  0.29852022,  0.01002278]])

In [15]:
logR.score(x_train,y_train)

0.6781437125748503

In [26]:
import pandas as pd
dfx = pd.get_dummies(df['sex'])

In [33]:
df = pd.concat([df,dfx],axis= 1)

In [38]:
dfx = pd.get_dummies(df['pclass'], prefix ='pclass', drop_first = True)
df = pd.concat([df,dfx], axis= 1)

In [39]:
df.head(4)

   survived  pclass     sex  ...  pclass_3.0  pclass_2.0  pclass_3.0
0       0.0     3.0    male  ...           1           0           1
1       1.0     1.0  female  ...           0           0           0
2       1.0     3.0  female  ...           1           0           1
3       1.0     1.0  female  ...           0           0           0

[4 rows x 31 columns]

In [20]:
df

     survived  pclass     sex   age  ...  female  male  pclass_2 pclass_3
0         0.0     3.0    male  22.0  ...     0.0   1.0       NaN      NaN
1         1.0     1.0  female  38.0  ...     1.0   0.0       NaN      NaN
2         1.0     3.0  female  26.0  ...     1.0   0.0       NaN      NaN
3         1.0     1.0  female  35.0  ...     1.0   0.0       NaN      NaN
4         0.0     3.0    male  35.0  ...     0.0   1.0       NaN      NaN
..        ...     ...     ...   ...  ...     ...   ...       ...      ...
886       NaN     NaN     NaN   NaN  ...     NaN   NaN       1.0      0.0
887       NaN     NaN     NaN   NaN  ...     NaN   NaN       0.0      0.0
888       NaN     NaN     NaN   NaN  ...     NaN   NaN       0.0      1.0
889       NaN     NaN     NaN   NaN  ...     NaN   NaN       0.0      0.0
890       NaN     NaN     NaN   NaN  ...     NaN   NaN       0.0      1.0

[1782 rows x 19 columns]

In [21]:
X = df[['fare', 'female', 'male', 'pclass_1', 'pclass_2', 'pclass_3']]
Y= df[['survived']]
X.shape, Y.shape

KeyError: ignored

In [ ]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)
X = scaler.transform(X)
X.shape

In [ ]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X,Y)

In [ ]:
from sklearn.linear_model import LogisticRegression
logR = LogisticRegression()
logR.fit(x_train, y_train)

In [ ]:
logR.score(x_train, y_train)